betaflight/betaflight/src/platform/common/stm32/can_hw.c
//-----------------------------------------------------------------------------
// Bit timing for 1 Mbit/s classic CAN
//
// The FDCAN kernel clock tree differs per family and per board. On G4 the
// system clock config explicitly selects RCC_FDCANCLKSOURCE_PCLK1 (see
// system_stm32g4xx.c) which on overclocked FCs runs at 150-170 MHz. On H7
// the selector in RCC->D2CCIP1R.FDCANSEL defaults to HSE but may be tuned
// per board. Hard-coding a prescaler therefore gives the wrong line rate on
// any board whose FDCAN kernel clock does not match the assumption.
//
// canNominalBitTiming() discovers the actual FDCAN kernel clock at init
// time and searches for a (prescaler, tseg1, tseg2) triple that lands
// exactly on CAN_BITRATE_NOMINAL with a sample point near 75 %. On clocks
// that are integer multiples of 1 MHz (common FC configurations) the search
// always succeeds; if no valid setting is found we fall back to the
// historical 24 MHz preset rather than misconfiguring silently.
//
// TODO: expose the target bit rate (and eventually the FDCAN clock source
// selection) via a PG so boards running at non-integer MHz can override.
//-----------------------------------------------------------------------------

// NBTP fields: NTSEG1=bits 8:15, NTSEG2=bits 0:6, NBRP=16:24, NSJW=25:31
#define CAN_NBTP_NSJW_POS       (25U)
#define CAN_NBTP_NBRP_POS       (16U)
#define CAN_NBTP_NTSEG1_POS     (8U)
#define CAN_NBTP_NTSEG2_POS     (0U)

#define CAN_BITRATE_NOMINAL     (1000000U)
#define CAN_NBRP_MAX            (512U)
#define CAN_NTSEG1_MAX          (256U)
#define CAN_NTSEG2_MAX          (128U)
#define CAN_TOTAL_TQ_MIN        (8U)
#define CAN_TOTAL_TQ_MAX        (25U)

// Sample-point target in tenths of a per-mille (i.e. 750 = 75.0%).
#define CAN_SAMPLE_POINT_PERMILLE (750U)

static uint32_t canPackNominalBitTiming(uint32_t nbrp, uint32_t ntseg1,
                                        uint32_t ntseg2, uint32_t nsjw)
{
    // Register fields store (value - 1); caller passes the real tq counts.
    return ((nsjw - 1U)   << CAN_NBTP_NSJW_POS)
         | ((nbrp - 1U)   << CAN_NBTP_NBRP_POS)
         | ((ntseg1 - 1U) << CAN_NBTP_NTSEG1_POS)
         | ((ntseg2 - 1U) << CAN_NBTP_NTSEG2_POS);
}

// Query the FDCAN kernel clock. HAL_RCCEx_GetPeriphCLKFreq tracks the
// family's actual clock-source selection where available; C5's HAL2 has
// no equivalent that works without a handle, so fall back to PCLK1 which
// matches the HAL2 reset default for FDCAN.
static uint32_t canGetKernelClockHz(void)
{
#if defined(STM32G4) || defined(STM32H7)
    return HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_FDCAN);
#else
    return HAL_RCC_GetPCLK1Freq();
#endif
}

static uint32_t canNominalBitTiming(void)
{
    const uint32_t kernelHz = canGetKernelClockHz();

    // Search for a prescaler that divides the kernel clock down to an
    // integer tq count in the valid range [8..25]. Pick the first match,
    // which is the smallest prescaler (gives finest resolution for SJW).
    for (uint32_t nbrp = 1; nbrp <= CAN_NBRP_MAX; nbrp++) {
        if ((kernelHz % nbrp) != 0U) {
            continue;
        }
        const uint32_t tqClock = kernelHz / nbrp;
        if ((tqClock % CAN_BITRATE_NOMINAL) != 0U) {
            continue;
        }
        const uint32_t totalTq = tqClock / CAN_BITRATE_NOMINAL;
        if (totalTq < CAN_TOTAL_TQ_MIN || totalTq > CAN_TOTAL_TQ_MAX) {
            continue;
        }

        // Sample point falls after (1 SYNC_SEG + tseg1). Round to the
        // nearest tq and clamp so tseg2 stays >= 1.
        uint32_t ntseg1 = (totalTq * CAN_SAMPLE_POINT_PERMILLE + 500U) / 1000U;
        if (ntseg1 < 1U) {
            ntseg1 = 1U;
        }
        if (ntseg1 >= totalTq) {
            ntseg1 = totalTq - 1U;
        }
        const uint32_t ntseg2 = totalTq - 1U - ntseg1;
        if (ntseg1 < 1U || ntseg1 > CAN_NTSEG1_MAX) {
            continue;
        }
        if (ntseg2 < 1U || ntseg2 > CAN_NTSEG2_MAX) {
            continue;
        }

        // SJW = min(4, tseg2) keeps resync margin within spec.
        const uint32_t nsjw = (ntseg2 < 4U) ? ntseg2 : 4U;
        return canPackNominalBitTiming(nbrp, ntseg1, ntseg2, nsjw);
    }

    // Fallback: legacy 24 MHz preset. Produces 1 Mbit/s only on 24 MHz
    // kernel clocks; on any other clock this is better than wedging init.
    return canPackNominalBitTiming(1U, 17U, 6U, 1U);
}

//-----------------------------------------------------------------------------
// Tx/Rx element header encoding (identical across G4 and H7 M_CAN IP)
//
// Word 0: ID field.
//  - Standard ID occupies bits 18..28 (11-bit ID shifted left by 18).
//  - Extended ID occupies bits 0..28, with XTD (bit 30) set.
// Word 1: DLC + flags (bits 16..19 = DLC, FDF = bit 21, BRS = bit 20).
// Words 2..: payload, packed little-endian 4 bytes per word.
//-----------------------------------------------------------------------------

#define CAN_TX_WORD0_XTD        (1UL << 30)
#define CAN_TX_WORD1_DLC_POS    (16U)

#define CAN_RX_WORD0_XTD        (1UL << 30)
#define CAN_RX_WORD0_EXTID_MASK (0x1FFFFFFFUL)
#define CAN_RX_WORD0_STDID_POS  (18U)
#define CAN_RX_WORD0_STDID_MASK (0x7FFUL << CAN_RX_WORD0_STDID_POS)
#define CAN_RX_WORD1_DLC_POS    (16U)
#define CAN_RX_WORD1_DLC_MASK   (0xFUL << CAN_RX_WORD1_DLC_POS)

//-----------------------------------------------------------------------------
// Low-level helpers (register level)
//-----------------------------------------------------------------------------

static FDCAN_GlobalTypeDef *canRegs(canDevice_e device)
{
    return (FDCAN_GlobalTypeDef *)canDevice[device].reg;
}

// Bounded spin count for CCCR.INIT transitions. At 170 MHz SYSCLK this
// translates to ~600 us of worst-case polling, which is more than enough
// for the peripheral to synchronise (the datasheet spec is a few bit times)
// but short enough that a stuck peripheral does not wedge boot.
#define CAN_INIT_SPIN_MAX       (100000U)

// Enter INIT + CCE (configuration change enable). Required for any change to
// bit timing or message RAM layout. Busy-loops until the peripheral reports
// that INIT has taken effect.
static bool canEnterConfigMode(FDCAN_GlobalTypeDef *regs)
{
    regs->CCCR |= FDCAN_CCCR_INIT;

    // Peripheral synchronises to the bus before asserting INIT. Give it a
    // bounded number of polls so a disconnected transceiver does not hang us.
    uint32_t timeout = CAN_INIT_SPIN_MAX;
    while (!(regs->CCCR & FDCAN_CCCR_INIT) && timeout--) {
        // spin
    }
    if (!(regs->CCCR & FDCAN_CCCR_INIT)) {
        return false;
    }

