betaflight/betaflight/src/platform/common/stm32/can_hw.c
    canEnableInterrupt(device, pDev->irq0);

    if (!canExitConfigMode(regs)) {
        // Peripheral stuck in init — leave device flagged uninitialised so
        // canTransmit() and canInit()'s caller see the failure.
        return;
    }

    pDev->initialized = true;
}

bool canInit(canDevice_e device)
{
    if (device < 0 || device >= CANDEV_COUNT) {
        return false;
    }

    canInitDevice(device);
    return canDevice[device].initialized;
}

void canRegisterRxCallback(canDevice_e device, canRxCallbackPtr callback)
{
    if (device < 0 || device >= CANDEV_COUNT) {
        return;
    }

    canDevice[device].rxCallback = callback;
}

// NOTE: canTransmit() is NOT internally synchronised. The read-modify-write
// sequence on the Tx FIFO (read TXFQS put-index, write slot, set TXBAR) is
// not re-entrant; calling concurrently from thread context and an ISR can
// corrupt messages. Callers must serialise externally if they need that.
bool canTransmit(canDevice_e device, uint32_t identifier, bool isExtended,
                 const uint8_t *data, uint8_t length)
{
    if (device < 0 || device >= CANDEV_COUNT) {
        return false;
    }

    canDevice_t *pDev = &canDevice[device];
    if (!pDev->initialized || length > CAN_CLASSIC_MAX_DLC) {
        return false;
    }

    // Per API contract: data may be NULL only if length is zero. Reject
    // the invalid combination rather than dereferencing a null pointer.
    if (length > 0 && data == NULL) {
        return false;
    }

    FDCAN_GlobalTypeDef *regs = canRegs(device);

    // Bail early if the hardware FIFO is full. The caller decides whether to
    // retry or drop; we don't block so the ISR-side callers stay non-blocking.
    uint32_t txfqs = regs->TXFQS;
    if (txfqs & FDCAN_TXFQS_TFQF) {
        return false;
    }

    // Put index tells us which slot in the Tx FIFO the next message belongs
    // in. The peripheral manages the ring; software just fills the slot and
    // sets the corresponding TXBAR bit.
    uint32_t putIndex = (txfqs & FDCAN_TXFQS_TFQPI) >> 16;
    volatile uint32_t *slot = (volatile uint32_t *)canTxElementAddress(device, putIndex);

    // Word 0: identifier with XTD flag if extended.
    if (isExtended) {
        slot[0] = CAN_TX_WORD0_XTD | (identifier & 0x1FFFFFFFUL);
    } else {
        slot[0] = (identifier & 0x7FFUL) << 18;
    }

    // Word 1: length only (no BRS/FDF -> classic CAN frame).
    slot[1] = (uint32_t)length << CAN_TX_WORD1_DLC_POS;

    // Words 2..3: copy the payload in 32-bit chunks. The Tx RAM requires
    // 32-bit writes and classic CAN tops out at 8 bytes of payload, so two
    // words is always enough.
    uint32_t words[2] = { 0, 0 };
    for (uint8_t i = 0; i < length; i++) {
        words[i >> 2] |= ((uint32_t)data[i]) << ((i & 3U) * 8U);
    }
    slot[2] = words[0];
    slot[3] = words[1];

    // Trigger transmission of this slot.
    regs->TXBAR = 1UL << putIndex;

    return true;
}

//-----------------------------------------------------------------------------
// ISR dispatch
//-----------------------------------------------------------------------------

static void canDispatchRx(canDevice_e device)
{
    canDevice_t *pDev = &canDevice[device];
    FDCAN_GlobalTypeDef *regs = canRegs(device);

    // Drain the FIFO. F0FL = fill level; looping until it hits zero guarantees
    // we handle multiple arrivals that may have accumulated before the ISR ran.
    while (regs->RXF0S & FDCAN_RXF0S_F0FL) {
        uint32_t getIndex = (regs->RXF0S & FDCAN_RXF0S_F0GI) >> 8;

        volatile const uint32_t *slot =
            (volatile const uint32_t *)canRxElementAddress(device, getIndex);

        uint32_t w0 = slot[0];
        uint32_t w1 = slot[1];

        bool isExtended = (w0 & CAN_RX_WORD0_XTD) != 0;
        uint32_t identifier = isExtended
            ? (w0 & CAN_RX_WORD0_EXTID_MASK)
            : ((w0 & CAN_RX_WORD0_STDID_MASK) >> CAN_RX_WORD0_STDID_POS);

        uint8_t dlc = (w1 & CAN_RX_WORD1_DLC_MASK) >> CAN_RX_WORD1_DLC_POS;
        if (dlc > CAN_CLASSIC_MAX_DLC) {
            dlc = CAN_CLASSIC_MAX_DLC;        // classic CAN safety clamp
        }

        uint8_t payload[CAN_CLASSIC_MAX_DLC];
        uint32_t w2 = slot[2];
        uint32_t w3 = slot[3];
        for (uint8_t i = 0; i < dlc; i++) {
            uint32_t word = (i < 4) ? w2 : w3;
            payload[i] = (uint8_t)(word >> ((i & 3U) * 8U));
        }

        // Ack the slot so the peripheral can recycle it for the next message.
        // Must be done before invoking the callback in case the callback is
        // slow; pending messages can still queue in other slots.
        regs->RXF0A = getIndex;

        if (pDev->rxCallback) {
            pDev->rxCallback(identifier, isExtended, payload, dlc);
        }
    }
}

void canIrqHandler(canDevice_e device)
{
    FDCAN_GlobalTypeDef *regs = canRegs(device);

    uint32_t ir = regs->IR;

    if (ir & FDCAN_IR_RF0N) {
        regs->IR = FDCAN_IR_RF0N;             // write-1-to-clear
        canDispatchRx(device);
    }

    // RF0L = Rx FIFO 0 message lost (overrun). Drop the flag so the
    // peripheral re-arms; dropped frames are visible in the device state
    // via an incrementing counter for diagnostics.
    if (ir & FDCAN_IR_RF0L) {
        regs->IR = FDCAN_IR_RF0L;
        canDevice[device].rxOverruns++;
    }
}

// Strong definitions of the FDCAN IRQ handlers (weak stubs in startup *.s).
// These only exist when CAN is compiled in; otherwise the linker keeps the
// weak Default_Handler stubs. FDCAN3 is guarded with #ifdef so H7 variants
// without that instance (H74x/H75x) do not pick up an unresolved symbol.

void FDCAN1_IT0_IRQHandler(void)
{
    canIrqHandler(CANDEV_1);
}

void FDCAN2_IT0_IRQHandler(void)
{
    canIrqHandler(CANDEV_2);
}

#if defined(FDCAN3)
void FDCAN3_IT0_IRQHandler(void)
{
    canIrqHandler(CANDEV_3);
}
#endif

#endif // ENABLE_CAN
